#1 ვიქტორინა

# question=("“რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი)"
#           " ფუნქციონირებს დღესაც?")
#
# answers="1.შუმერთა\n2.სელჩუკთა \n3.რომის \n4.მონღოლთა\n"
# answer=input(f"{question}\nსავარაუდო პასუხები:\n{answers}")
#
# if answer=="3" or answer=="რომის":
#     print("სწორია!")
# else:
#     print("არა! სწორი პასუხია \"რომის\"!")



#2 ონლაინ მაღაზია

# options="1.ლეპტოპები\n2.პერსონალური კომპიუტერები\n3.მობილურები\n"
# print(options)
# budget=int(input("შეიყვანეთ თქვენი ბიუჯეტი: "))
# product_num=int(input("აირჩიეთ სასურველი კატეგორია(მიუთითეთ მხოლოდ რიცხვი!)."))
#
# leptop1="ASUS Zenbook 14 Flip OLED (2023)"
# leptop2="Dell XPS 13 Plus (2022)"
# leptop3="HP ENVY x360 15 (2023)"
#
# PC1="HP ENVY All-in-One 34-c1045t"
# PC2="HP Pavilion 27I AiO PC"
# PC3="MacBook Pro (16-inch, 2023)"
#
# phone1="redmi note 12"
# phone2="pixel 8 pro"
# phone3="iphone 14"
#
# if product_num==1:
#     if budget>=3000:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {leptop1},{leptop3} ან {leptop2}.")
#     elif budget>=2200 and budget<3000:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {leptop3} ან {leptop2}.")
#     elif budget>=1400 and budget<2200:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {leptop2}.")
#     else:
#         print("სამწუხაროდ თქვენი თანხა არასაკმარისია და არ გვაქვს შეთავაზება.")
# elif product_num==2:
#     if budget >= 3500:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {PC1},{PC2} ან {PC3}.")
#     elif budget >= 2500 and budget < 3500:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {PC2} ან {PC3}.")
#     elif budget >= 1500 and budget < 2500:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {PC3}.")
#     else:
#         print("სამწუხაროდ თქვენი თანხა არასაკმარისია და არ გვაქვს შეთავაზება.")
# elif product_num==3:
#     if budget >= 3900:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {phone3},{phone2} ან {phone1}.")
#     elif budget >= 2400 and budget < 3900:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {phone1} ან {phone2}.")
#     elif budget >= 1200 and budget < 2400:
#         print(f"თქვენ შეგიძლიათ იყიდოთ {phone1}.")
#     else:
#         print("სამწუხაროდ თქვენი თანხა არასაკმარისია და არ გვაქვს შეთავაზება.")
# else:
#     print("შეიყვანეთ სწორი მონაცემი!")



#3 შტორმი

# fuel=int(input("დარჩენილი საწვავის რაოდენობა: "))
# poss_dist_in_km=fuel/12
# if poss_dist_in_km>=100:
#     print("თქვენ შეგიძლიათ მიაღწიოთ მადრიდის, ვალენსიის ან სარაგოსას აეროპორტამდე.")
# elif poss_dist_in_km>=75 and poss_dist_in_km<100:
#     print("თქვენ შეგიძლიათ მიაღწიოთ ვალენსიის ან სარაგოსას აეროპორტამდე.")
# elif poss_dist_in_km>=50 and poss_dist_in_km<75:
#     print("თქვენ შეგიძლიათ მიაღწიოთ სარაგოსის  აეროპორტამდე.")
# else:
#     print("სამწუხაროდ ვერცერთი ქალაქის აეროპორტამდე ვერ მიაღწევთ.")



#4 მომხმარებლისთვის კარიერის შერჩევა

# programmer, graphic_designer, actor, politician, sport_commentator = ("პროგრამისტი",
#  "გრაფიკოსი დიზაინერი", "მსახიობი", "პოლიტიკოსი", "სპორტული კომენტატორი")
#
# quest__1="\nრამდენ უცხო ენას ფლობ?\n1.არცერთს\n2.ერთს\n3.ორს ან მეტს\n"
#
# quest__2=("\nჩამოთვლილთაგან რომლის კეთება გირჩევნია თავისუფალ დროს?"
#           "\n1.ხატვა\n2.მეგობრებთან გართობა\n3.FIFA-ს თამაში\n")
#
# quest__3=("\nრამდენად კარგად იმახსოვრებ რიცხვებს, მოგონებებს, ახალ ინფორმაციას?"
#           "\n1.არც ისე კარგად\n2.კარგად\n3.ძალიან კარგად\n")
#
# quest__4=("\nრამდენად კარგად გეხერხება ტყუილის თქმა?"
#           "\n1.ძალიან ცუდად\n2.არც ისე კარგად\n3.ძალიან კარგად\n")
#
# quest__5=("\nროგორ აკონტროლებ შენს ემოციებს?"
#           "\n1.თითქმის ვერ ვაკონტროლებ\n2.სხვა რამეზე გადამაქვს ყურადღება"
#           "\n3.ვცდილობ არ გამოვხატო\n")
#
# quest__6=("\nრას აკეთებ, როცა რაღაც არ გამოგდის?"
#           "\n1.თავს ვანებებ\n2.ვღიზიანდები"
#           "\n3.მიუხედავად წარუმატებლობისა, მაინც ვცდილობ გავაკეთო\n")
#
# quest__7=("\nჩამოთვლილთაგან რომლის ყურება გიყვარს ყველაზე მეტად?"
#           "\n1.ფილმების და სერიალების\n2.ფეხბურთის\n3.პოლიტიკური გადაცემების\n")
#
# quest__8=("\nროდის ანებებ თავს რაიმე საქმის კეთებას?"
#           "\n1.როცა მბეზრდება\n2.როცა მეზარება\n3.როცა მეტის კეთება აღარ შემიძლია\n")
#
# quest__9=("\nახერხებ თუ არა წაკითხულის ან მოსმენილის გონებაში ვიზუალურ წარმოსახვას?"
#           "\n1.ვერა\n2.გარკვეულწილად\n3.კი\n")
#
# quest__10=("\nჩამოთვლილი პიროვნებებიდან რომელთან ისურვებდი საუბარს?"
#            "\n1.ლიონელ მესისთან\n2.მარიო ჩიმაროსთან\n3.დონალდ ტრამპთან\n")
#
# answer_1=int(input(quest__1))
# answer_2=int(input(quest__2))
# answer_3=int(input(quest__3))
# answer_4=int(input(quest__4))
# answer_5=int(input(quest__5))
# answer_6=int(input(quest__6))
# answer_7=int(input(quest__7))
# answer_8=int(input(quest__8))
# answer_9=int(input(quest__9))
# answer_10=int(input(quest__10))
#
# prog_points=graph_points=act_points=politic_points=sport_points=0
#
# if answer_3==3:
#    prog_points+=1
# if answer_5==2:
#    prog_points+=1
# if answer_6==3:
#    prog_points+=1
# if answer_8==3:
#    prog_points+=1
# if answer_9==2:
#    prog_points+=1
#
#
# if answer_2==1:
#    graph_points+=1
# if answer_5==2:
#    graph_points+=1
# if answer_6==3:
#    graph_points+=1
# if answer_8==3:
#    graph_points+=1
# if answer_9==3:
#    graph_points+=1
#
#
# if answer_2==2:
#    act_points+=1
# if answer_4==3:
#    act_points+=1
# if answer_5==2:
#    act_points+=1
# if answer_7==1:
#    act_points+=1
# if answer_10==2:
#    act_points+=1
#
#
# if answer_1==3:
#    politic_points+=1
# if answer_4==3:
#    politic_points+=1
# if answer_5==3:
#    politic_points+=1
# if answer_7==3:
#    politic_points+=1
# if answer_10==3:
#    politic_points+=1
#
#
# if answer_2==3:
#    sport_points+=1
# if answer_3==3:
#    sport_points+=1
# if answer_5==3:
#    sport_points+=1
# if answer_7==2:
#    sport_points+=1
# if answer_10==1:
#    sport_points+=1
#
#
# if prog_points>graph_points and prog_points>act_points and prog_points>politic_points and prog_points>sport_points:
#    print(f"გილოცავთ,თქვენგან კარგი {programmer} დადგებოდა.")
# elif graph_points>prog_points and graph_points>act_points and graph_points>politic_points and graph_points>sport_points:
#    print(f"გილოცავთ,თქვენგან კარგი {graphic_designer} დადგებოდა.")
# elif act_points>prog_points and act_points>graph_points and act_points>politic_points and act_points>sport_points:
#    print(f"გილოცავთ,თქვენგან კარგი {actor} დადგებოდა.")
# elif politic_points>prog_points and politic_points>graph_points and act_points>act_points and politic_points>sport_points:
#    print(f"გილოცავთ,თქვენგან კარგი {politician} დადგებოდა.")
# elif sport_points>prog_points and sport_points>graph_points and sport_points>act_points and sport_points>politic_points:
#    print(f"გილოცავთ,თქვენგან კარგი {sport_commentator} დადგებოდა.")
# else:
#  print("სამწუხაროდ, ვერ დავადგინეთ თქვენთვის შესაფერისი კარიერა.")



#5(არასავალდებულო დავალება)

# print("გავი, შენ ახლა მადრიდში იმყოფები, \"სანტიაგო ბერნაბეუზე\". ბარსა-რეალის მატჩის ანგარიში 0-0-ია."
#       " \nთუ სწორ გადაწყვეტილებებს მიიღებ,შეძლებ თამაშის ბედის შეცვლას. მე-5 დამატებული წუთის მიდის \n"
#       "და ბურთით სწორედ შენა ხარ მოედნის ცენტრში.")
#
# opt_1=int(input("ვის გადააწოდებ ბურთს?\n 1.გიუნდოგანს, რომელიც მარცხენა ფლანგისკენ მიიწევს."
#                 "\n2.პედრის, რომელიც თავისუფალ სივრცეშია."))
#
#
# if opt_1==1:
#     opt_2=int(input("ამჯერად რას მოიმოქმედებ?\n1.გავაგრძელებ სვლას წინ."
#                     "\n2.გავყვები გიუდოგანს ბურთის გასათამაშებლად"))
#     if opt_2==1:
#         opt_3=int(input("გიუნდოგანმა ბურთი კანსელუს გააყოლა ფლანგზე, კანსელუმ შენკენ გამოაგორა,"
#                         "\nშემდეგ კი საჯარიმოში შერბენა დაიწყო გამჭოლი გადაცემის მოლოდინში.\n"
#                         "საჯარიმოში კი ლევანდოვსკი დგას, თუმცა მილიტაო და რუდიგერი მეურვეობენ.\n"
#                         "რას მოიმოქმედებ?\n1.კანსელუს გავუყოლებ.\n2.ლევანოვსკის ჩავუწოდებ."))
#         if opt_3==1:
#             print("ყოჩაღ, გავი! შენი პასით კასნსელომ გამარჯვების გოლი მოუტანა ბარსელონას!")
#         elif opt_3==2:
#             opt_4=int(input("რეალის დაცვამ ჩაწოდება მოიგერია და ახლა სწრაფ კონრშეტევაზე გარბის შეტევა."
#                             "\n1. როგორ ითამაშებ ასეთ დროს?\n1.დავუცდი, როდის დაიბრუნებს დაცვა ბურთს."
#                             "\n2.ჩავალ დაცვაში და გუნდს მივეხმარები."))
#             if opt_4==1:
#                 print("შენი გადაწყვეტილება სავალალო აღმოჩნდა!\n"
#                       "დაცვა ვეღარ გაუმკლავდა როდრიგოსა და ვინისიუსის სწრაფ შეტევას.")
#             elif opt_4==2:
#                 print("ამჯერად სწორად ითამაშე. შენი დახმარებით ბარსამ კონტრშეტევა \n"
#                       "მოიგერია და მატჩი ფრედ დასრულდა.")
#             else:
#                 print("შეიყვანეთ 1 ან 2!")
#         else:
#             print("შეიყვანეთ 1 ან 2!")
#     elif opt_2==2:
#         opt_3=int(input("გიუნდოგანი ცენტრისკენ შემოიწია, მარჯვენა ფლანგისკენ დაძრული რაფინია შეამჩნია \n"
#                         "და ბურთი გადააწოდა. რაფინიამ ცრუმოძრაობა გააკეთა საჯარიმოში შეძვრა. ცენტრალური დაცვა\n"
#                         " მასზე გადაერთო და სივრცეც დატოვა. შენ სწორედ თავისუფალი სივრცისკენ მიიწევ და რაფინიასგან\n"
#                         " ბურთი მოგდის.\nროგორ მოიქცევი?\n1.დავარტყავ მარცხენა დაბალი კუთხისკენ.\n2.გაცილებით კარგ პოზიციაში"
#                         " მყოფ ჯოაო ფელიშს გავუკეთებ პასს."))
#         if opt_3==1:
#             print("ამ მომენტში ნამდვილად იჩქარე. კურტუამ მოახერხა ბურთის მოგერიება და მატჩი ფრედ დასრულდა.")
#         elif opt_3==2:
#             print("გილოცავ! შენი პასი ჟოაო ფელიშმა გოლად აქცია და ბარსელონამ თამაში მოიგო.")
#         else:
#             print("შეიყვანეთ 1 ან 2!")
#     else:
#         print("შეიყვანეთ 1 ან 2!")
# elif opt_1==2:
#     opt_2=int(input("ამჯერად რას მოიმოქმედებ?\n1.წავალ წინ, საჯარიმოს სიახლოვეს."
#                     "\n2.პედრის გავუთამაშებ კედელს."))
#     if opt_2==1:
#         opt_3=int(input("პედრიმ ბურთი ლევანდოვსკისთან გაითამაშა, არაუხო საჯარიმოსკენ წავიდა."
#                         " ბურთი ისევ შენ\n გიბრუნდება. წინ მილიტაო გიდგას. არაუხო კი ჩაწოდებას ელის."
#                         "\nრას იზავ?\n1.მილიტაოს მოტყუებას ვცდი.\n2.არაუხოს ჩავუწოდებ."))
#         if opt_3==1:
#             print("შენი ცრუმოძრაობა ზედმეტი აღმოჩნდა. ბურთი დაკარგე და ეს შენს გუნდი ძლივს\n"
#                   " გადარჩა მატჩის წაგებას.")
#         elif opt_3==2:
#             print("შენ მიერ მიღებული გადაწყვეტილება ნამდვილად გონივრული აღმოჩნდა. \n"
#             "არაუხოს თაურის შემდეგ კურტუა უშანსოდ დარჩა. მადრიდელებმა ვერ გადაარჩინეს მატჩი.")
#         else:
#             print("შეიყვანეთ 1 ან 2!")
#     elif opt_2==2:
#         opt_3=int(input("შენ და პედრი ცენტრიდან ცდილობთ კურტუას კარის დალაშქვრას."
#                         " გიუნდოგანი მარცხენა\n ფლანგიდან სიღრმისკენ მიიწევს. არაუხო კი მარჯვენა ფლანგისკენ გარბის \n"
#                         "საჯარიმოში ჩასაწოდებლად.\nვის გაუკეთებ პასს?\n1.გიუნდოგანს, რომელიც კარგ დასარტყამ პოზიციაშია."
#                         "\n2.არაუხოს, რომელიც მოულოდნელად გამჭოლ პასს აკეთებს ფელიშის მიმართულებით."))
#         if opt_3==1:
#             print("გიუნდოგანზე პასი არ იყო ურიგო გადაწყვეტილება, თუმცა გერმანელმა ვერ მოახერხა \n"
#                   "გამარჯვების გოლის გატანა.")
#         elif opt_3==2:
#             opt_4=int(input("ფელიშმა დარტყმა მოიხერხა, თუმცა დარტყმა კარვახალმა მოიგერია.\n"
#             "შენ ამ დროს წინ მიიწევ. ბურთი საჯარიმოს ხაზთან მოგივიდა. საჯარიმოში არეულობაა."
#                     "\nრას აკეთებ?\n1საჯარიმოში ვაწვდი.\n2.ძლიერად ვურტყავ მეკარის საპირისპირო კუთხეში."))
#             if opt_4==1:
#                 print("ეს ჩაწოდება უადგილო იყო. ვერცერთმა ბარსას ფეხბურთელმა ვერ ითამაშა ბურთზე და მადრიდელებმა\n"
#                       "მარტივად მოახერხეს თამაშის ფრედ დასრულება.")
#             elif opt_4==2:
#                 print("გოოოოოოლ!!! გავი, შენ ეს შეძელი. დაძაბულ ბრძოლაში გმირად მოევლინე გუნდს და"
#                       " \n ბრწყინვალე გამარჯვება მოუტანე!")
#             else:
#                 print("შეიყვანეთ 1 ან 2!")
#         else:
#             print("შეიყვანეთ 1 ან 2!")
#     else:
#         print("შეიყვანეთ 1 ან 2!")
# else:
#     print("შეიყვანეთ 1 ან 2!")